function print() {
  console.log(
    '%c_______  __   __  _______    _______  ___      _______  _______ \n' +
    '%c|       ||  | |  ||       |  |  _    ||   |    |       ||       |\n' +
    '%c|    ___||  |_|  ||  _____|  | |_|   ||   |    |   _   ||    ___|\n' +
    '%c|   |___ |       || |_____   |       ||   |    |  | |  ||   | __ \n' +
    '%c|    ___||_     _||_____  |  |  _   | |   |___ |  |_|  ||   ||  |\n' +
    '%c|   |      |   |   _____| |  | |_|   ||       ||       ||   |_| |\n' +
    '%c|___|      |___|  |_______|  |_______||_______||_______||_______|\n' +
    '   ',
    'color:#00FFB1',
    'color:#00FF3B',
    'color:#D0FD00',
    'color:#FEDA00',
    'color:#FFAD00',
    'color:#ff7500',
    'color:#ff0000',
  )
  console.log('欢迎访问我的技术博客，可以换个友情链接再走哟 ~')
  console.log('祝你身体健康，生活愉快，保持活力，愿世界和平！')
}

print()
